c5/src/Enums/Calculations/Calculations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Calculations</name>
  <enumValues>
    <name>Absence</name>
  </enumValues>
  <enumValues>
    <name>Amount</name>
  </enumValues>
  <enumValues>
    <name>Annual</name>
  </enumValues>
  <enumValues>
    <name>Banked</name>
  </enumValues>
  <enumValues>
    <name>BankedUse</name>
  </enumValues>
  <enumValues>
    <name>ChildCare</name>
  </enumValues>
  <enumValues>
    <name>CompensationPercent</name>
  </enumValues>
  <enumValues>
    <name>DailyPercent</name>
  </enumValues>
  <enumValues>
    <name>DayOff</name>
  </enumValues>
  <enumValues>
    <name>EveningHours</name>
  </enumValues>
  <enumValues>
    <name>ExtendedVacation</name>
  </enumValues>
  <enumValues>
    <name>ExtraChildCare</name>
  </enumValues>
  <enumValues>
    <name>FixedAmount</name>
  </enumValues>
  <enumValues>
    <name>IncomeTax</name>
  </enumValues>
  <enumValues>
    <name>HolidayHours</name>
  </enumValues>
  <enumValues>
    <name>HourlyRate</name>
  </enumValues>
  <enumValues>
    <name>MedicalInsurance</name>
  </enumValues>
  <enumValues>
    <name>MonthlyRate</name>
  </enumValues>
  <enumValues>
    <name>NightHours</name>
  </enumValues>
  <enumValues>
    <name>Overtime</name>
  </enumValues>
  <enumValues>
    <name>PaternityVacation</name>
  </enumValues>
  <enumValues>
    <name>Percent</name>
  </enumValues>
  <enumValues>
    <name>Quarterly</name>
  </enumValues>
  <enumValues>
    <name>SickDays</name>
  </enumValues>
  <enumValues>
    <name>SickDaysChild</name>
  </enumValues>
  <enumValues>
    <name>SickOnlySocial</name>
  </enumValues>
  <enumValues>
    <name>SickProduction</name>
  </enumValues>
  <enumValues>
    <name>SocialInsurance</name>
  </enumValues>
  <enumValues>
    <name>Vacation</name>
  </enumValues>
  <enumValues>
    <name>VacationWithoutPay</name>
  </enumValues>
</mdclass:Enum>

c5/src/CommonModules/PayrollItemForm/Module.bsl
&AtClient
Procedure MethodOnChange ( Form ) export
	
	object = Form.Object;
	PayrollItemForm.SetDescription ( object );
	resetBase ( object );
	if ( TypeOf ( object.Ref ) = Type ( "ChartOfCalculationTypesRef.Compensations" ) ) then
		resetHourlyRate ( object );
	else
		resetNet ( object );
	endif; 
	Appearance.Apply ( Form, "Object.Method" );
	
EndProcedure

&AtClient
Procedure resetBase ( Object )
	
	method = Object.Method;
	type = TypeOf ( Object.Ref );
	if ( type = Type ( "ChartOfCalculationTypesRef.Compensations" ) ) then
		if ( method = PredefinedValue ( "Enum.Calculations.Percent" )
			or method = PredefinedValue ( "Enum.Calculations.Vacation" )
			or method = PredefinedValue ( "Enum.Calculations.ExtendedVacation" )
			or method = PredefinedValue ( "Enum.Calculations.SickDays" ) ) then
		else
			Object.BaseCalculationTypes.Clear ();
		endif; 
	else
		if ( Object.Method = PredefinedValue ( "Enum.Calculations.FixedAmount" ) ) then
			Object.BaseCalculationTypes.Clear ();
		endif;
	endif; 

EndProcedure 

&AtClient
Procedure resetHourlyRate ( Object )
	
	if ( Object.Method = PredefinedValue ( "Enum.Calculations.MonthlyRate" ) ) then
		Object.HourlyRate = PredefinedValue ( "Enum.HourlyRate.Monthly" );
	else
		Object.HourlyRate = undefined;
	endif; 

EndProcedure 

&AtClient
Procedure resetNet ( Object )

	method = Object.Method;
	if ( method <> PredefinedValue ( "Enum.Calculations.Percent" )
		and method <> PredefinedValue ( "Enum.Calculations.FixedAmount" ) ) then
		Object.Net = false;
	endif; 

EndProcedure

Procedure SetDescription ( Object ) export
	
	Object.Description = Object.Method;
	setCode ( Object );
	
EndProcedure 

Procedure setCode ( Object )
	
	Object.Code = Conversion.DescriptionToCode ( Object.Description );
	
EndProcedure 

&AtClient
Procedure DescriptionOnChange ( Form ) export
	
	setCode ( Form.Object );
	
EndProcedure
